[{"name":"Documentation","description":"Welcome to Bridge Documentation","path":"/documentation","text":"","wordCount":0,"type":"TOC"},{"name":"Bridge Overview - Start Here","description":"A brief description of Bridge software and its features","path":"/documentation/overview","text":"Bridge\nBridge is an online professional networking platform and client management tool suite for mental healthcare professionals.\nThe features implemented consist of registering as a mental healthcare professional, creating a public profile to display practice information, searching for other professional peers, and connecting to those peers.\nFeatures Implemented\nLogin / Sign Up\n    Use an email and password to create a unique account\nNavigation Bar\n    Links to all Bridge pages accessible from anywhere on the Bridge site\n    Easily set your personal availability\n        Either Available or Not Available (with an optional upcoming date of availability)\nProfile Page\n    View practice information inherent to a mental health professional\n    Edit your profile (if on your own profile) to display desired information\nSearch\n    Search for professionals related to specific keywords\n    Apply filters (alongside your keywords) related to fields such as:\n        Pay type\n        Specialty\n        Language\n        Client Type\n        Treatments\n        Modality\n        Budget\n        Location\nConnections Page\n    View and internally search professionals one is currently connected to\n    Respond to pending invitations/connections","wordCount":151,"type":"Content"},{"name":"How to use Bridge","description":"How to use functionality of Bridge Software","path":"/documentation/howto","text":"","wordCount":0,"type":"TOC"},{"name":"Testing Process Introduction","description":"How to use this documentation to explore Bridge","path":"/documentation/howto/introduction","text":"\nIntroduction\n\nThis following documentation guides a user through the necessary steps and guidelines to register for an account, login to our website, and navigate through profile and connections, along with its components.\n","wordCount":31,"type":"Content"},{"name":"Accounts (Login and Registration)","description":"Describes Account Login and Registration","path":"/documentation/howto/accounts","text":"Registration / Logging into the Application\n\nLogin\n\nEnter email and password, and press login\nlogin page\n\nRegistration\n\nEnter first name, last name, email, license number, password\n","wordCount":21,"type":"Content"},{"name":"Your Profile","description":"Describes Profile Functionality","path":"/documentation/howto/profile","text":"Profile Management\n\nAccessing your profile\n\nFind the navigation bar on the left hand side.\nHome page with navigation bar highlighted\nSelect your icon on the bottom of the navigation bar. The navigation bar can be either collapsed or expanded.\nProfile Icon\n\nAccessing someone else’s profile\n\nWhen you see a listing of other clinicians, whether it be through the search feature on the upper right of the website, on the list of connections, or on a profile, simply click on the user’s icon to be moved to their profile. This will allow you to refer, connect, view their information, among other features.\n\nEditing your profile\n\nNavigate to your own profile (see Accessing your profile above).\nHit the “Edit” button in the upper right corner of your profile.\nYour profile will now have text boxes for each section. You may add, delete, or edit the information in each field.\n","wordCount":136,"type":"Content"},{"name":"Navigation","description":"How to navigate around the Bridge website","path":"/documentation/howto/navigation","text":"Profile Management\n\nAccessing your profile\n\nFind the navigation bar on the left hand side.\nHome page with navigation bar highlighted\nSelect your icon on the bottom of the navigation bar. The navigation bar can be either collapsed or expanded.\nProfile Icon\n\nAccessing someone else’s profile\n\nWhen you see a listing of other clinicians, whether it be through the search feature on the upper right of the website, on the list of connections, or on a profile, simply click on the user’s icon to be moved to their profile. This will allow you to refer, connect, view their information, among other features.\n\nEditing your profile\n\nNavigate to your own profile (see Accessing your profile above).\nHit the “Edit” button in the upper right corner of your profile.\nYour profile will now have text boxes for each section. You may add, delete, or edit the information in each field.\n","wordCount":136,"type":"Content"},{"name":"Search","description":"Describes Search Functionality","path":"/documentation/howto/search","text":"","wordCount":0,"type":"Content"},{"name":"Connections","description":"Describes Connections Page Functionality","path":"/documentation/howto/connections","text":"","wordCount":0,"type":"Content"},{"name":"End User License Agreement","description":"End User License Agreement for the Bridge Website","path":"/documentation/eula","text":"End-User License Agreement\n\nLast updated: 15 April 2020\n\nPlease read this End-User License Agreement (\"Agreement\") between Bridge (the “Company”) and you (the “Licensee”) carefully before using the Bridge Website (\"Website\").\n\nBy using the Website, you are agreeing to be bound by the terms and conditions of this Agreement.\n\nIf you do not agree to the terms of this Agreement, do not use the Website.\n\nLicense\nThe Company grants you a revocable, non-exclusive, non-transferable, limited license to use the Website solely for your personal and commercial purposes strictly in accordance with the terms of this Agreement.\n\nRestrictions\nYou agree not to, and you will not permit others to:\n\na) license, sell, rent, lease, assign, distribute, transmit, host, outsource, disclose or otherwise commercially exploit the Website or make the Website available to any third party.\n\nb) use the Website or any data or information gathered from it to harm or threaten another individual or business in any way.\n\nLimitation of Liability\nThe Website is provided by the Company and accepted by the Licensee “as is.” The Company will not be liable for any general, special, incidental, or consequential damages including, but not limited to, loss of production, loss of profits, loss of revenue, loss of data, or any other business or economic disadvantage suffered by the Licensee arising out of the use or failure to use the Website\n\nModifications to the Website\nBridge reserves the right to modify, suspend or discontinue, temporarily or permanently, the Website or any service to which it connects, with or without notice and without liability to you.\n\nTerm and Termination\nThis Agreement shall remain in effect until terminated by the Licensee or the Company.\n\nThe Company may, in its sole discretion, at any time and for any or no reason, suspend or terminate this Agreement with or without prior notice.\n\nThis Agreement will terminate immediately, without prior notice from the Company, in the event that you fail to comply with any provision of this Agreement.\n\nUpon termination of this Agreement, you shall cease all use of the Website and its services.\n\nSeverability\nIf any provision of this Agreement is held to be unenforceable or invalid, such provision will be changed and interpreted to accomplish the objectives of such provision to the greatest extent possible under applicable law and the remaining provisions will continue in full force and effect.\n\nAmendments to this Agreement\nBridge reserves the right, at its sole discretion, to modify or replace this Agreement at any time. If a revision is material, we will provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change will be determined at the Company’s sole discretion.\n\nContact Information\nIf you have any questions about this Agreement, please contact us.\n","wordCount":433,"type":"Content"},{"name":"Privacy Policy","description":"Privacy Policy for the Bridge Website","path":"/documentation/privacy","text":"Privacy Policy\n\nCollected User Information\n\nPersonal Information\n\nOur site will collect and maintain personal information provided by users, including their names, addresses, mobile telephone numbers, email addresses, location, etc. The amount of information provided by users is completely voluntary; however, providing less information might limit a user&#39;s ability to access all of the site&#39;s features.\n\nUpdating User Information\n\nUsers are permitted to correct, update, or change their personal information, as well as, adjust or cease the frequency with which they receive company communications. The user also has the ability to disable their account, in accordance with the Terms of Use. Methodology for disabling an account is provided in the Bridge User Guide under disabling an account.\n\nUsage and Analytics Data\n\nOur company collects usage information in order to assess how users access and utilize the site. This data is valuable to the company for various internal purposes, including troubleshooting and improving the site&#39;s functionality. The information we collect might include the user&#39;s Internet service provider, type of web browser or operating system, IP address, viewed pages, time and duration of site visits, crash logs, and other information relating to site usage.\n\nCookies\n\nMost web browsers are initially set up to accept cookies. Users can reset their web browser to refuse all cookies or to indicate when a cookie is being sent. Please note, however, that certain features of the site might not function if you delete or disable cookies. THE SITE&#39;S COOKIES DO NOT AND CANNOT INFILTRATE A USER&#39;S HARD DRIVE TO COLLECT ANY INFORMATION STORED ON THE HARD DRIVE.\n\nSecurity\n\nWe would like to assure our users that the company will use the necessary measures to protect the security of your data. However, it is impossible for the company to completely guarantee that user data will be immune from malicious attack or compromise; as such, users should understand that transmission of personal data is always at their own risk.\n\nCompany Usage of User Data\n\nBilling Information\n\nUser billing information is used in order to process payments, keep payment records, and otherwise make site features available to the user.\n\nCustomer Support and Follow-ups\n\nUser information is used for customer support services, including dealing with guarantees, technical support, billing and payment issues, or other matters. Our company might also collect user information for routine follow-ups in order to assess customer satisfaction.\n\nGeneral Announcements\n\nOur website might use personal information for periodic general announcements to users. These can include notifications, updates regarding the company or the site, marketing communications, and so forth.\n\nCompany Service and Third Party Service Providers\n\nOur company might need to use personal user data in connection with website maintenance, upgrades, new releases, or analytics data review and compilation. We will be required to share user data with any third-party service providers that may be engaged to assist in these efforts, however, message data and identifying information such as names or billing information will not be shared without consent. Similarly, we may have to share user information in connection with third-party marketing or advertising services. However, Bridge vets all third party service providers thoroughly and ensures that each one employs adequate security measures with respect to user data.\n\nSharing Data\n\nSharing User Data\n\nAs a general policy, we use personal information and message data for internal purposes only. We do not sell or rent information about you. We will not disclose personal information or message data to third parties without your consent, except as explained in this Privacy Policy. Patient information is protected under HIPAA and the company adheres to all HIPAA guidelines.\n\nSharing with Affiliates or Acquirers\n\nUser data will be shared with affiliated entities, including parent companies and subsidiaries. Furthermore, if the company participates in a merger, stock purchase, asset purchase, or other acquisition, it will be required to share user information with the purchaser or surviving entity.\n\nCompliance with Laws\n\nThe Company cooperates with government and law enforcement officials to enforce and comply with the law. We may therefore disclose personal information, usage data, message data, and any other information about you, if we deem that it is reasonably necessary to: (a) satisfy any applicable law, regulation, legal process (such as a subpoena or court order), or enforceable governmental request; (b) enforce the Terms of Use, including investigation of potential violations thereof; (c) detect, prevent, or otherwise address fraud, security or technical issues; or (d) protect against harm to the rights, property or safety of the Company, its users or the public, as required or permitted by law.\n\nStorage and Maintenance of User Data in the United States\n\nUser data is collected and stored domestically in the United States, as such user information will be subject to the laws of the United States of America, regardless of the country from which their data originates.\n\nUser Safekeeping of Personal Data\n\nBridge would like to remind users to carefully protect the personal information that they submit on the site — including their passwords, usernames, location, images, and videos — so that other parties can&#39;t manipulate their accounts or assume their identities. Users should not disclose any sensitive information about themselves or others in the public domain nor should patient information be discussed outside of compliance with HIPAA guidelines.\n\nChanges to the Privacy Policy\n\nOur company may make changes to its privacy policy from time-to-time. Users should periodically revisit the policy for any updates. The company will also make an effort to notify its users of any policy changes, and require that users acknowledge updates by checking a box or pressing a button. Users who continue to interact with the site following a revision of the company&#39;s privacy policy will automatically be subject to the new terms. If you have any concerns or questions regarding Bridge&#39;s privacy policy please feel free to submit a detailed description of the query to our feedback page and we will do our best to resolve it.\n","wordCount":950,"type":"Content"},{"name":"Feedback","description":"Send us your questions, comments, and/or concerns about Bridge","path":"/documentation/feedback","text":"Please feel free to fill out the Feedback Form to give us feedback.\n\nOr feel free to email fletcheaston.bridge@gmail.com.","wordCount":18,"type":"Content"}]